basic/controllers/IndexController.php

DELETE FROM `wx_num` WHERE `w_id` IS NULL
---
    public function actionDel_w(){

        $request = Yii::$app->request;
        $id= $request->get('w_id');       //接受要删除的id
        if(WxNum::deleteAll(['w_id'=>$id])){

SELECT `w_id`, `w_name` FROM `wx_num`
---
    public function actionMyself(){
        $rows = (new \yii\db\Query())->select(['w_id','w_name' ])->from('wx_num')->all();

SELECT `w_appid`, `w_serveid` FROM `wx_num` WHERE `w_id`='3'
---
    public function actionCheck(){
        $request = Yii::$app->request;
        $session = Yii::$app->session;
        $w_id=$request->get('w_id');
        $rows = (new \yii\db\Query())->select(['w_appid','w_serveid' ])->from('wx_num')->where(['w_id' =>$w_id])
            ->one();