basic/controllers/LoginController.php

SELECT * FROM `wx_admin` WHERE (`u_name`='admin') AND (`u_pwd`='0192023a7bbd73250516f069df18b500')
---
    public function actionIndex(){
        $session = Yii::$app->session;
        $request= yii::$app->request;
            if(!$request->isPost){
               return $this->renderPartial('login');
            }
        $u_name=$request->post('u_name');
        $u_pwd= md5($request->post('u_pwd'));
        $login=WxAdmin::find()->where(['u_name'=>$u_name,'u_pwd'=>$u_pwd])->asArray()->one();