basic/controllers/ReplyController.php

    public function actionNews(){
//        $connection = Yii::$app->db;
//        $connection->createCommand("select * from ")->queryAll();
        $rows = (new \yii\db\Query())->select(['w_id','w_name' ])->from('wx_num')->all();
        $rows = (new \yii\db\Query())->select(['w_id','w_name' ])->from('wx_num')->all();
---
SELECT `w_id`, `w_name` FROM `wx_num`

    public  function  actionHui(){
        $request=Yii::$app->request;
        $get=$request->get();
         unset($get['r']);
//        print_r($get);die;
        $get=str_replace($get['g_reply'],htmlspecialchars($get['g_reply']),$get);
        $connection = Yii::$app->db;
        $connection->createCommand()->insert('wx_reply',$get)->execute();
        $WxReply=new WxReply();
        $rows=$WxReply->find()->where(['w_id'=>$get['w_id']])->asArray()->all();
---
INSERT INTO `wx_reply` (`w_id`, `g_rule`, `g_reply`, `g_type`) VALUES (3, '好', '有点坏', 1)
SELECT * FROM `wx_reply` WHERE `w_id`='3'

    public  function  actionGuize(){
//        echo 1;die;

        $request=Yii::$app->request;
        $w_id=$request->get('w_id');
        $WxReply=new WxReply();
        $rows=$WxReply->find()->where(['w_id'=>$w_id])->asArray()->all();
---
SELECT * FROM `wx_reply` WHERE `w_id`='3'

    public  function  actionDel(){
        $request=Yii::$app->request;
        $WxReply=new WxReply();
        $id=$request->get('id');
        $WxReply->findOne($id)->delete();
---
DELETE FROM `wx_reply` WHERE `g_id`=25
SELECT * FROM `wx_reply` WHERE `g_id`='25'